import React from 'react';
import FAQAccordion, {
  QuestionItem,
  Question,
  Answer,
} from '../../components/FAQAccordion';

const Iphone13ProFAQ = () => {
  return (
    <FAQAccordion>
      <QuestionItem>
        <Question>ทำไมจึงควรซื้อ iPhone แบบที่ไม่มีซิมบน apple.com</Question>
        <Answer>
          <p>
            iPhone ที่ไม่ได้ผูกอยู่กับผู้ให้บริการและซื้อจาก apple.com
            นั้นเป็นรุ่นปลดล็อค
            ซึ่งหมายความว่าคุณไม่มีข้อผูกมัดกับผู้ให้บริการเครือข่ายรายใดรายหนึ่ง
            หรือกับสัญญาการให้บริการที่มีระยะเวลาหลายปี
            คุณจึงสามารถเลือกเครือข่ายและค่าบริการที่เหมาะกับคุณได้ และเมื่อ
            iPhone เครื่องใหม่ของคุณได้รับการเปิดใช้งานแล้ว
            เครื่องนั้นก็จะยังคงสถานะการปลดล็อคเช่นเดิม
            ซึ่งหมายความว่าคุณสามารถนำไปใช้กับเครือข่ายใดก็ได้ที่มีบริการสำหรับ
            iPhone
          </p>
        </Answer>
      </QuestionItem>
      <QuestionItem>
        <Question>iPhone เครื่องใหม่ของฉันจะเป็นเครื่องปลดล็อคหรือไม่</Question>
        <Answer>
          <p>
            ใช่ iPhone ที่ไม่ได้ผูกอยู่กับผู้ให้บริการและซื้อจาก apple.com
            นั้นเป็นรุ่นปลดล็อค
            ซึ่งหมายความว่าคุณไม่มีข้อผูกมัดกับผู้ให้บริการเครือข่ายรายใดรายหนึ่ง
            หรือกับสัญญาการให้บริการที่มีระยะเวลาหลายปี
            คุณจึงสามารถเลือกผู้ให้บริการที่เหมาะกับคุณได้ และเมื่อ iPhone
            เครื่องใหม่ของคุณได้รับการเปิดใช้งานแล้ว
            เครื่องนั้นก็จะยังคงสถานะการปลดล็อคเช่นเดิม
            ซึ่งหมายความว่าคุณสามารถนำไปใช้กับเครือข่ายใดก็ได้ที่มีบริการสำหรับ
            iPhone
          </p>
        </Answer>
      </QuestionItem>
      <QuestionItem>
        <Question>
          การถ่ายโอนข้อมูลและตั้งค่า iPhone เครื่องใหม่นั้นง่ายจริงมั้ย
        </Question>
        <Answer>
          <p className="mb-3">
            ง่ายจริง เพราะ iCloud ช่วยให้คุณย้ายการตั้งค่า รูปภาพ แอป
            และเอกสารต่างๆ มายังอุปกรณ์เครื่องใหม่ได้อย่างราบรื่น
            เพียงลงชื่อเข้าใช้ iCloud ขณะตั้งค่าอุปกรณ์เครื่องใหม่
            จากนั้นเข้าถึงข้อมูลสำรอง iCloud ของอุปกรณ์เครื่องก่อนหน้า
            แล้วในไม่กี่นาทีทุกอย่างก็จะพร้อมให้คุณใช้งาน
          </p>
          <p className="mb-3">
            หากมีพื้นที่จัดเก็บข้อมูล iCloud
            ไม่พอที่จะสำรองข้อมูลได้เสร็จสมบูรณ์ iCloud
            จะอนุญาตให้คุณมีพื้นที่จัดเก็บข้อมูลชั่วคราวที่เพียงพอเพื่อให้คุณมั่นใจว่าจะสามารถสำรองข้อมูลจากอุปกรณ์ของคุณและถ่ายโอนข้อมูลทั้งหมดโดยไม่มีค่าใช้จ่าย
            (จำเป็นต้องใช้ iOS 15 )
          </p>
          <p className="mb-3">
            คุณสมบัติ "เริ่มใช้อย่างรวดเร็ว"​
            ให้คุณกู้คืนข้อมูลและคอนเทนต์จากข้อมูลสำรอง iCloud ไปยัง iPhone
            เครื่องใหม่ได้ ซึ่งหากเป็นโทรศัพท์ที่ใช้ iOS 12.4 หรือใหม่กว่า
            คุณสมบัติ "เริ่มใช้อย่างรวดเร็ว"​
            ก็จะมีตัวเลือกให้คุณย้ายข้อมูลระหว่างอุปกรณ์
            ซึ่งช่วยให้คุณสามารถถ่ายโอนข้อมูลทั้งหมดจากเครื่องปัจจุบันไปยังเครื่องใหม่ในแบบไร้สายได้
          </p>
          <p className="mb-3">
            หากคุณย้ายมาจาก Android คุณจำเป็นต้องดาวน์โหลดแอป "ย้ายไปยัง iOS"
            ก่อน แล้วทำตามกระบวนการตั้งค่าบน iPhone เครื่องใหม่
          </p>
          <p>
            ดูวิธีถ่ายโอนข้อมูลไปยัง iPhone เครื่องใหม่ได้ที่{' '}
            <a href="https://support.apple.com/th-th/HT201269">
              support.apple.com/th-th/HT201269
            </a>
          </p>
        </Answer>
      </QuestionItem>
    </FAQAccordion>
  );
};

export default Iphone13ProFAQ;
